NordicSemiconductor/nrfx/mdk/nrf54l15_enga_flpr_peripherals.h
/*VPR peripheral registers*/
#define VPR_PRESENT 1
#define VPR_COUNT 1

#define VPR00_INIT_PC_RESET_VALUE 0x00000000         /*!< Boot vector (INIT_PC_RESET_VALUE): 0x00000000                        */
#define VPR00_VPR_START_RESET_VALUE 0                /*!< Self-booting (VPR_START_RESET_VALUE): 0                              */
#define VPR00_RAM_BASE_ADDR 0x00000000               /*!< VPR RAM base address (RAM_BASE_ADDR): 0x00000000                     */
#define VPR00_RAM_SZ 0                               /*!< VPR RAM size (RAM_SZ): 0 (Value in bytes is computed as 2^(RAM size))*/
#define VPR00_RETAINED 0                             /*!< Retain registers in Deep Sleep mode: 0                               */
#define VPR00_VPRSAVEDCTX 1                          /*!< (unspecified)                                                        */
#define VPR00_VPRSAVEADDR 0x00000000                 /*!< VPR context save address: 0x00000000                                 */
#define VPR00_VPRREMAPADDRVTOB 0x00000000            /*!< VPR remap address: 0x00000000                                        */
#define VPR00_VEVIF_NTASKS_MIN 0                     /*!< VEVIF tasks: 0..31                                                   */
#define VPR00_VEVIF_NTASKS_MAX 31                    /*!< VEVIF tasks: 0..31                                                   */
#define VPR00_VEVIF_NTASKS_SIZE 32                   /*!< VEVIF tasks: 0..31                                                   */
#define VPR00_VEVIF_TASKS_MASK 0xFFFFFFFF            /*!< Mask of supported VEVIF tasks: 0xFFFFFFFF                            */
#define VPR00_VEVIF_NDPPI_MIN 0                      /*!< VEVIF DPPI channels: 0..31                                           */
#define VPR00_VEVIF_NDPPI_MAX 31                     /*!< VEVIF DPPI channels: 0..31                                           */
#define VPR00_VEVIF_NDPPI_SIZE 32                    /*!< VEVIF DPPI channels: 0..31                                           */
#define VPR00_VEVIF_NEVENTS_MIN 0                    /*!< VEVIF events: 0..31                                                  */
#define VPR00_VEVIF_NEVENTS_MAX 31                   /*!< VEVIF events: 0..31                                                  */
#define VPR00_VEVIF_NEVENTS_SIZE 32                  /*!< VEVIF events: 0..31                                                  */
#define VPR00_DEBUGGER_OFFSET 1024                   /*!< Debugger interface register offset: 0x5004C400                       */

/*GPIO Port*/
#define GPIO_PRESENT 1
#define GPIO_COUNT 3

#define P2_CTRLSEL_MAP1 0                            /*!< (unspecified)                                                        */
#define P2_CTRLSEL_MAP2 1                            /*!< (unspecified)                                                        */
#define P2_PIN_NUM_MIN 0                             /*!< (unspecified)                                                        */
#define P2_PIN_NUM_MAX 10                            /*!< (unspecified)                                                        */
#define P2_PIN_NUM_SIZE 11                           /*!< (unspecified)                                                        */
#define P2_PINS_PRESENT 2047                         /*!< (unspecified)                                                        */
#define P2_DRIVECTRL 0                               /*!< (unspecified)                                                        */
#define P2_RETAIN 0                                  /*!< (unspecified)                                                        */
#define P2_PWRCTRL 0                                 /*!< (unspecified)                                                        */
#define P2_PWRCTRL_SEPARATE_REG 0                    /*!< (unspecified)                                                        */
#define P2_VSS_FLOAT_DFT 0                           /*!< (unspecified)                                                        */
#define P2_PIN_OWNER_SEC 0                           /*!< (unspecified)                                                        */
#define P2_WIFI_CORE_PRESENT 0                       /*!< (unspecified)                                                        */
#define P2_RETAIN_PER_PIN 0                          /*!< (unspecified)                                                        */
#define P2_CLOCKPIN 0                                /*!< (unspecified)                                                        */

#define P1_CTRLSEL_MAP1 0                            /*!< (unspecified)                                                        */
#define P1_CTRLSEL_MAP2 1                            /*!< (unspecified)                                                        */
#define P1_PIN_NUM_MIN 0                             /*!< (unspecified)                                                        */
#define P1_PIN_NUM_MAX 15                            /*!< (unspecified)                                                        */
#define P1_PIN_NUM_SIZE 16                           /*!< (unspecified)                                                        */
#define P1_PINS_PRESENT 65535                        /*!< (unspecified)                                                        */
#define P1_DRIVECTRL 0                               /*!< (unspecified)                                                        */
#define P1_RETAIN 0                                  /*!< (unspecified)                                                        */
#define P1_PWRCTRL 0                                 /*!< (unspecified)                                                        */
#define P1_PWRCTRL_SEPARATE_REG 0                    /*!< (unspecified)                                                        */
#define P1_VSS_FLOAT_DFT 0                           /*!< (unspecified)                                                        */
#define P1_PIN_OWNER_SEC 0                           /*!< (unspecified)                                                        */
#define P1_WIFI_CORE_PRESENT 0                       /*!< (unspecified)                                                        */
#define P1_RETAIN_PER_PIN 0                          /*!< (unspecified)                                                        */
#define P1_CLOCKPIN 0                                /*!< (unspecified)                                                        */

